# CantChangeParamFlip Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures..::..CantChangeParamFlip Property
BuiltInFailures..::..PointFailures Class See Also
---
Can't flip Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantChangeParamFlip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantChangeParamFlip As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantChangeParamFlip {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PointFailures Class
Autodesk.Revit.DB Namespace